EA/src/Catalogs/ПравилаОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ПравилаОбменаДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/Catalogs/ПравилаОбменаДанными/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Сохранение );
	ДиалогВыбораФайла.ПолноеИмяФайла = Объект.ИмяФайла;
	
	Если ДиалогВыбораФайла.Выбрать() = Истина Тогда
		
		АдресХранилищаТекущихПравил = ПрочитатьИзХранилищаНаСервере();
		ДвоичныеДанные = ПолучитьИзВременногоХранилища( АдресХранилищаТекущихПравил );
		ДвоичныеДанные.Записать( ДиалогВыбораФайла.ПолноеИмяФайла );
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьИзХранилищаНаСервере()
	
	ДвоичныеДанные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( Объект.Ссылка, "Хранилище" ).Получить();
	
	Возврат ПоместитьВоВременноеХранилище( ДвоичныеДанные );
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьИзФайла(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Открытие );
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ПолноеИмяФайла = Объект.ИмяФайла;
	
	Если ДиалогВыбораФайла.Выбрать() = Истина Тогда
		
		ДвоичныеДанные = Новый ДвоичныеДанные( ДиалогВыбораФайла.ПолноеИмяФайла );
		АдресХранилища = ПоместитьВоВременноеХранилище( ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор );
		
		Объект.ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
		Объект.ДатаЗагрузки = ТекущаяДата();
		
		ЭтаФорма.ПравилаБылаИзменены = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПустаяСтрока( ТекущийОбъект.ИмяФайла ) Тогда
		ОбменДаннымиСервер.СообщитьОбОшибке( "Не загружены правила.", Отказ );
	ИначеЕсли ЭтаФорма.ПравилаБылаИзменены = Истина Тогда
		ТекущийОбъект.Хранилище = Новый ХранилищеЗначения( ПолучитьИзВременногоХранилища( ЭтаФорма.АдресХранилища ), Новый СжатиеДанных(9) );
	КонецЕсли;
	
КонецПроцедуры
